//----------------------------------------------------------------------
// MMusicTable.cpp
//----------------------------------------------------------------------
#include "Client_PCH.h"
#include "MMusicTable.h"

//----------------------------------------------------------------------
// 전역 변수
//----------------------------------------------------------------------
MUSIC_TABLE*	g_pMusicTable = NULL;

//----------------------------------------------------------------------
// 파일에 저장
//----------------------------------------------------------------------
void			
MUSICTABLE_INFO::SaveToFile(std::ofstream& file)
{
	Filename.SaveToFile( file );
	FilenameWav.SaveToFile( file );
}

//----------------------------------------------------------------------
// 파일에서 불러오기
//----------------------------------------------------------------------
void			
MUSICTABLE_INFO::LoadFromFile(std::ifstream& file)
{
	Filename.LoadFromFile( file );
	FilenameWav.LoadFromFile( file );
}